class RagConstants:
    
    LLM_MULTI_SELECTOR_PROMPT = (
                "Some choices are given below. It is provided in a numbered "
                "list (1 to {num_choices}), "
                "where each item in the list corresponds to a summary.\n"
                "---------------------\n"
                "{context_list}"
                "\n---------------------\n"
                "Using only the choices above and not prior knowledge, return the top choice(s) "
                "(no more than {max_outputs}) that are most relevant to the "
                "question: '{query_str}'\n"
                "Your response MUST be ONLY a valid JSON list of objects, where each "
                "object has a 'choice' (integer) and 'reason' (string) key. "
                "Do not include any other text, markdown formatting, or explanations."
            )
    
    COLLECTIONS = {
        #1
        # "avg_score_aug_5sub_filename": """
        #     Бұл коллекцияда 2024 жылғы тамыздағы Ұлттық бірыңғай тестілеу (ЕНТ) нәтижелері бойынша облыстардың орташа баллдары көрсетілген. 
        #     Деректер 5 пән бойынша қатысушылар саны мен орташа баллдарын қамтиды, олар тестілеу тілі (қазақ, орыс, ағылшын) және орналасқан жері (қалалық/ауылдық) бойынша бөлінген.
        #     Эта коллекция содержит данные о среднем балле областей по результатам Единого национального тестирования (ЕНТ), проведенного в августе 2024 года. 
        #     В данных представлены количество участников и их средние баллы по 5 предметам, с разбивкой по языку тестирования (казахский, русский, английский) и типу населенного пункта (городской/сельский).
        # """,
        # #2
        # "avg_score_jan_5sub_filename": """
        #     Бұл коллекцияда 2024 жылғы қаңтардағы Ұлттық бірыңғай тестілеу (ЕНТ) нәтижелері бойынша облыстардың орташа баллдары көрсетілген. 
        #     Деректер 5 пән бойынша қатысушылар саны мен орташа баллдарын қамтиды, олар тестілеу тілі (қазақ, орыс, ағылшын) және орналасқан жері (қалалық/ауылдық) бойынша бөлінген.
        #     Эта коллекция содержит данные о среднем балле областей по результатам Единого национального тестирования (ЕНТ), проведенного в январе 2024 года. 
        #     В данных представлены количество участников и их средние баллы по 5 предметам, с разбивкой по языку тестирования (казахский, русский, английский) и типу населенного пункта (городской/сельский).
        # """,
        # #3
        # "avg_score_mar_5sub_filename": """
        #     Бұл коллекцияда 2024 жылғы наурыздағы Ұлттық бірыңғай тестілеу (ЕНТ) нәтижелері бойынша облыстардың орташа баллдары көрсетілген. 
        #     Деректер 5 пән бойынша қатысушылар саны мен орташа баллдарын қамтиды, олар тестілеу тілі (қазақ, орыс, ағылшын) және орналасқан жері (қалалық/ауылдық) бойынша бөлінген.
        #     Эта коллекция содержит данные о среднем балле областей по результатам Единого национального тестирования (ЕНТ), проведенного в марте 2024 года. 
        #     В данных представлены количество участников и их средние баллы по 5 предметам, с разбивкой по языку тестирования (казахский, русский, английский) и типу населенного пункта (городской/сельский).
        # """,
        # #4
        # "avg_score_may-jul_5sub_filename": """
        #     Бұл коллекцияда 2024 жылғы мамыр мен шілде аралығындағы Ұлттық бірыңғай тестілеу (ЕНТ) нәтижелері бойынша облыстардың орташа баллдары көрсетілген. 
        #     Деректер 5 пән бойынша қатысушылар саны мен орташа баллдарын қамтиды, олар тестілеу тілі (қазақ, орыс, ағылшын) және орналасқан жері (қалалық/ауылдық) бойынша бөлінген.
        #     Эта коллекция содержит данные о среднем балле областей по результатам Единого национального тестирования (ЕНТ), проведенного в период с мая по июль 2024 года. 
        #     В данных представлены количество участников и их средние баллы по 5 предметам, с разбивкой по языку тестирования (казахский, русский, английский) и типу населенного пункта (городской/сельский).
        # """,
        # #5
        # "colleges_programmes_corr": """
        #     Бұл коллекция колледждердің білім беру бағдарламалары мен мамандықтары туралы мәліметтерді қамтиды. 
        #     Әрбір деректер нүктесінде білім беру бағдарламалары тобының коды (ГОП коды), бағдарламаның атауы қазақ және орыс тілдерінде, біліктілік коды, сондай-ақ мамандықтың қазақ және орыс тілдеріндегі толық атауы бар.
        #     Эта коллекция содержит информацию об образовательных программах и специальностях колледжей. 
        #     Каждая точка данных включает код группы образовательных программ (ГОП), наименования образовательной программы на казахском и русском языках, код квалификации, а также полное наименование специальности на казахском и русском языках.
        # """,
        # #6
        # "contingent_aug_filename": """
        #     Бұл коллекцияда 2024 жылғы тамыздағы Ұлттық бірыңғай тестілеу (ЕНТ) нәтижелері бойынша барлық тестіленушілердің контингенті мен жинаған баллдары туралы мәліметтер ұсынылған.
        #     Деректер ҰБТ өткізу пункттері (ҰБТӨП) бойынша толық қамтылған және өтініш берушілердің саны, тестілеуге қатысқандар, шекті деңгейден өткендер/өтпегендер саны мен пайызы, сондай-ақ пәндер санына байланысты орташа балдар (140 немесе 70 баллдық шкала бойынша) сияқты көрсеткіштерді қамтиды.
        #     Эта коллекция содержит сведения по контингенту и набранным баллам Единого национального тестирования (ЕНТ) всех тестируемых за август 2024 года. 
        #     Данные представлены в разрезе пунктов проведения ЕНТ (ППЕНТ) и включают такие показатели, как количество подавших заявления, участвовавших в тестировании, количество и процент не преодолевших/преодолевших пороговый уровень, а также средние баллы (по 140-балльной или 70-балльной шкале) в зависимости от количества предметов.
        # """,
        # #7
        # "contingent_jan_filename": """
        #     Бұл коллекцияда 2024 жылғы қаңтардағы Ұлттық бірыңғай тестілеу (ЕНТ) нәтижелері бойынша барлық тестіленушілердің контингенті мен жинаған баллдары туралы мәліметтер ұсынылған. 
        #     Деректер ҰБТ өткізу пункттері (ҰБТӨП) бойынша толық қамтылған және өтініш берушілердің саны, тестілеуге қатысқандар, шекті деңгейден өткендер/өтпегендер саны мен пайызы, сондай-ақ пәндер санына байланысты орташа балдар (140 немесе 70 баллдық шкала бойынша) сияқты көрсеткіштерді қамтиды.
        #     Эта коллекция содержит сведения по контингенту и набранным баллам Единого национального тестирования (ЕНТ) всех тестируемых за январь 2024 года. 
        #     Данные представлены в разрезе пунктов проведения ЕНТ (ППЕНТ) и включают такие показатели, как количество подавших заявления, участвовавших в тестировании, количество и процент не преодолевших/преодолевших пороговый уровень, а также средние баллы (по 140-балльной или 70-балльной шкале) в зависимости от количества предметов.
        # """,
        # #8
        # "contingent_mar_filename": """
        #     Бұл коллекцияда 2024 жылғы наурыздағы Ұлттық бірыңғай тестілеу (ЕНТ) нәтижелері бойынша барлық тестіленушілердің контингенті мен жинаған баллдары туралы мәліметтер ұсынылған.
        #     Деректер ҰБТ өткізу пункттері (ҰБТӨП) бойынша толық қамтылған және өтініш берушілердің саны, тестілеуге қатысқандар, шекті деңгейден өткендер/өтпегендер саны мен пайызы, сондай-ақ пәндер санына байланысты орташа балдар (140 немесе 70 баллдық шкала бойынша) сияқты көрсеткіштерді қамтиды.
        #     Эта коллекция содержит сведения по контингенту и набранным баллам Единого национального тестирования (ЕНТ) всех тестируемых за март 2024 года.
        #     Данные представлены в разрезе пунктов проведения ЕНТ (ППЕНТ) и включают такие показатели, как количество подавших заявления, участвовавших в тестировании, количество и процент не преодолевших/преодолевших пороговый уровень, а также средние баллы (по 140-балльной или 70-балльной шкале) в зависимости от количества предметов.
        # """,
        # #9
        # "contingent_may-jul_filename": """
        #     Бұл коллекцияда 2024 жылғы мамыр-шілде аралығындағы Ұлттық бірыңғай тестілеу (ЕНТ) нәтижелері бойынша барлық тестіленушілердің контингенті мен жинаған баллдары туралы мәліметтер ұсынылған.
        #     Деректер ҰБТ өткізу пункттері (ҰБТӨП) бойынша толық қамтылған және өтініш берушілердің саны, тестілеуге қатысқандар, шекті деңгейден өткендер/өтпегендер саны мен пайызы, сондай-ақ пәндер санына байланысты орташа балдар (140 немесе 70 баллдық шкала бойынша) сияқты көрсеткіштерді қамтиды.
        #     Эта коллекция содержит сведения по контингенту и набранным баллам Единого национального тестирования (ЕНТ) всех тестируемых за период с мая по июль 2024 года.
        #     Данные представлены в разрезе пунктов проведения ЕНТ (ППЕНТ) и включают такие показатели, как количество подавших заявления, участвовавших в тестировании, количество и процент не преодолевших/преодолевших пороговый уровень, а также средние баллы (по 140-балльной или 70-балльной шкале) в зависимости от количества предметов.
        # """,
        #10
        #1
        "grants_ru_NIck_new": """
            Этот набор данных содержит подробную информацию о распределении государственных образовательных грантов на подготовку кадров с высшим образованием в Республике Казахстан на 2025-2026 учебный год. Данные сгруппированы по направлениям подготовки, группам образовательных программ и включают в себя общее количество выделенных грантов, а также их разбивку по формам обучения (полное и сокращенное) и типам конкурса (общий конкурс и квоты).        """,
        #2
        "kvotas_ru_new": """
            Этот набор данных предоставляет детализированную информацию о распределении государственных образовательных грантов, выделяемых в виде квот для определенных социальных категорий граждан. Данные сгруппированы по общим направлениям подготовки и показывают, какое количество грантов зарезервировано для каждой льготной категории в рамках государственного заказа на 2025-2026 учебный год.

        """,
        #3
        "grants_kk_new": """
            Бұл жинақ (коллекция) әртүрлі грант түрлері, сондай-ақ арнайы бағыттар мен білім беру бағдарламалары топтары бойынша білім беру гранттарының бөлінуі туралы деректерді қамтиды.
        """,
        #4
        "kvotas_kk_new": """
            Бұл жинақ (коллекция) квоталар, арнайы бағыттар және білім беру бағдарламалары топтары бойынша білім беру гранттарының бөлінуі туралы деректерді қамтиды.
        """,
        #14
        # "min_ent": """
        #     Бұл коллекцияда 2025 жылғы гранттарға түсу үшін білім беру бағдарламалары бойынша ең төменгі шекті баллдар туралы ақпарат бар. 
        #     Әрбір деректер нүктесі жоғары оқу орны (ЖЖОКБҰ) орналасқан облыстың кодын және қазақ тіліндегі толық атауын, ЖЖОКБҰ кодын және орыс тіліндегі толық атауын, оқыту формасының орыс тіліндегі атауын, білім беру саласының шифрын және орыс тіліндегі атауын, сондай-ақ білім беру бағдарламалары тобының (БББТ) шифрын және орыс тіліндегі атауын қамтиды.
        #     Эта коллекция содержит информацию о минимальных пороговых баллах для поступления на грант по образовательным программам в 2025 году.
        #     Каждая точка данных включает код и полное наименование области, в которой расположен вуз (ОВПО), код и полное наименование ОВПО на русском языке, наименование формы обучения на русском языке, шифр и наименование области образования на русском языке, а также шифр и наименование группы образовательных программ (ГОП) на русском языке.
        # """,
        #5
        "non_npa_kk": """
            Бұл құжаттар жинағы қазақ тілінде Қазақстанның Ұлттық бірыңғай тестілеуіне (ҰБТ) қатысты жиі қойылатын сұрақтар мен олардың жауаптарынан тұрады. 
            Мазмұны негізінен 2025 жылғы ҰБТ цикліне қатысты болып, талапкерлерге, олардың ата-аналарына және білім беру мамандарына арналған. 
            Құжаттарда ҰБТ-ға тіркелу процесі, тест тапсыру ережелері (рұқсат етілген және тыйым салынған заттар), емтихан форматы (пәндер, сұрақтардың қиындық деңгейі), апелляцияға беру тәртібі, баллдарды есептеу, гранттар, сондай-ақ колледж түлектері мен қандастар сияқты арнайы санаттағы тұлғаларға арналған ақпарат қамтылған. 
            Сонымен қатар, онлайн байқау сынақтары, техникалық мәселелерді шешу (Face ID, жеке кабинетке кіру) және Ұлттық тестілеу орталығының (ҰТО) байланыс деректері туралы мәліметтер бар.    
        """,
        #6
        "non_npa_ru": """
            Эта коллекция содержит информационные материалы, инструкции и часто задаваемые вопросы на русском языке, касающиеся Единого национального тестирования (ЕНТ) в Казахстане на 2025 год. 
            Документы охватывают широкий круг тем для абитуриентов, включая процедуры и сроки регистрации, правила и формат экзамена, комбинации профильных предметов, стоимость, пороговые баллы и процесс апелляции. 
            Также здесь содержится информация для различных категорий поступающих, таких как выпускники школ и колледжей, кандасы и граждане, обучавшиеся за рубежом. 
            Цель коллекции — предоставить исчерпывающее руководство для тех, кто планирует сдавать ЕНТ для поступления в высшие учебные заведения.    
        """,
        #7
        "npa_204_kk": """
            Бұл құжаттар жинағы Қазақстан Республикасының жылдардағы нормативтік-құқықтық актілеріне негізделген Ұлттық бірыңғай тестілеуді (ҰБТ) өткізудің ресми қағидаларын қамтиды. Мазмұнында ҰБТ-ны электрондық форматта тапсыру, өтініш беру кезеңдері, тестілеу барысындағы тәртіп ережелері, тыйым салынған заттар, баллдарды есептеу және апелляцияға беру процедуралары егжей-тегжейлі баяндалады. 
            Сонымен қатар, халықаралық SAT, ACT, IB, A-Level сертификаттары бар тұлғаларға арналған ерекшеліктер мен жоғары білім бағдарламаларына сәйкес бейіндік пәндер тізбесі көрсетілген. Бұл дерекқор жоғары оқу орындарына түсуші талапкерлер, олардың ата-аналары және білім беру саласының мамандары үшін негізгі ақпарат көзі болып табылады. 
            Ұлттық бірыңғай тестілеудің бейіндік пәндері көрсетілген білім беру бағдарламалары топтарының тізбесі
        """,
        #8
        "npa_204_ru": """
            Официальный документ на русском языке, представляющий собой Приказ Министра науки и высшего образования Республики Казахстан, который регламентирует правила и порядок проведения Единого национального тестирования (ЕНТ). 
            Коллекция содержит подробную информацию обо всех аспектах ЕНТ, включая: форматы проведения (бумажный и электронный), категории участников (выпускники школ, колледжей, лица казахской национальности без гражданства, лица с инвалидностью), процедуру подачи заявлений и документов онлайн через сайт Национального центра тестирования. 
            Описываются правила поведения в аудитории, продолжительность экзамена, структура теста, перечень обязательных и профильных предметов для различных групп образовательных программ (ГОП), а также общепрофессиональных и специальных дисциплин для поступающих на программы с сокращенными сроками обучения. 
            Регламентируется система начисления баллов, максимальные и пороговые значения, работа комиссий (приемных, региональных, апелляционных), порядок подачи и рассмотрения апелляций, процедура аннулирования результатов при нарушениях, использование видеонаблюдения и запрещенные предметы. 
            Включены положения о выдаче сертификатов ЕНТ, правила конвертации баллов международных тестов (SAT, ACT, IB, A-Level, TOEFL, IELTS) и KAZTEST, а также условия для выпускников \"Назарбаев Интеллектуальные школы\".     
        """,
        #9
        "npa_326_ru": """
            Данная коллекция содержит официальные документы, регулирующие присуждение образовательных грантов победителям и призерам международных соревнований. 
            Документы охватывают полный перечень и критерии отбора для различных мероприятий: международных олимпиад по общеобразовательным предметам (математика, физика, химия, биология, география, информатика, лингвистика), международных спортивных соревнований (Олимпийские, Паралимпийские, Сурдлимпийские игры, чемпионаты мира, гимназиады), а также международных конкурсов исполнителей и творческих фестивалей (конкурс имени Чайковского, \"Арабеск\", \"Славянский базар\", конкурсы вокалистов Бибигуль Тулегеновой, соревнования по танцам). Включает информацию о финансировании из республиканского бюджета, аккредитации и правилах формирования сборных команд Казахстана.
        """,
        #10
        "npa_443_ru": """
            Коллекция содержит официальные юридические документы на русском языке, в частности Приказ и.о. Министра науки и высшего образования Республики Казахстан от 25 августа 2023 года № 443. 
            Документы регламентируют порядок присуждения образовательных грантов для оплаты высшего и послевузовского образования (бакалавриат, магистратура) за счет средств республиканского и местного бюджетов (гранты МИО). 
            Включены все темы, касающиеся этого процесса: правила проведения конкурса на основе баллов ЕНТ, КТ и GPA; порядок зачисления и аннулирования грантов; подготовку учителей по естественно-научным предметам на английском языке с требованиями к языковым сертификатам (TOEFL, IELTS), а также правила перераспределения вакантных грантов. Содержание актуально на 2023 год и последующие периоды.
            НЕ ВКЛЮЧАЕТ ТОЧНЫХ ЧИСЛЕННЫХ ДАННЫХ ПО ГРАНТАМ.    
        """,
        #11
        "npa_443_kk": """
            Бұл топтамада Қазақстан Республикасында республикалық және жергілікті бюджеттер есебінен \"Бакалавр\" және \"Магистр\" дәрежелері бойынша жоғары білім алуға арналған білім беру гранттарын беру тәртібін реттейтін қазақ тіліндегі ресми құжаттар мен ережелер жинақталған.
            Сонымен қатар, босаған гранттарды қайта тағайындау, шетелдік жоғары оқу орындарымен қос диплом бағдарламалары, құжаттарды тапсыру мерзімдері және шетел азаматтарына арналған ережелер қамтылған. 
            Ақпарат Қазақстан Республикасы Ғылым және жоғары білім министрлігінің 2022-2024 жылдарға арналған өзекті заңдары мен нормативтік актілеріне негізделген.    
            ГРАНТТАР БОЙЫНША НАҚТЫ САНДЫҚ ДЕРЕКТЕРДІ ҚАМТЫМАЙДЫ.
        """,
        #12
        "npa_600_ru": """
            "Коллекция содержит официальные нормативные документы на русском языке, а именно 'Типовые правила приема на обучение в организации образования, реализующие образовательные программы высшего и (или) послевузовского образования' (ОВПО), утвержденные Приказом Министра образования и науки Республики Казахстан от 31 октября 2018 года № 600, с актуальными изменениями и дополнениями до 2024 года. 
            Документы детально регламентируют весь процесс поступления в вузы Казахстана, включая: порядок подачи документов (в том числе через портал 'электронного правительства'), проведение и оценку специальных и творческих экзаменов, процедуры зачисления на платной и бюджетной основе, апелляцию. 
            Коллекция охватывает темы образовательных грантов, квот приема для различных категорий граждан, правила приема иностранных граждан, а также включает таблицы и шкалы перевода баллов международных стандартизированных тестов (ЕНТ, SAT, ACT, IB, A Level, TOEFL, IELTS, KAZTEST) и требования к абитуриентам по областям образования, таким как 'Педагогические науки' и 'Здравоохранение'."    
            НЕ ВКЛЮЧАЕТ ТОЧНЫХ ЧИСЛЕННЫХ ДАННЫХ ПО ГРАНТАМ.    

        """,
        #13
        "npa_600_kk": """
            Бұл коллекцияда Қазақстан Республикасының жоғары және (немесе) жоғары оқу орнынан кейінгі білім беру ұйымдарына (ЖЖОКБҰ) оқуға қабылдау тәртібін реттейтін, 2022-2023 жылдардағы бұйрықтарға негізделген, қазақ тіліндегі ресми нормативтік құқықтық актілер жинақталған. 
            Құжаттардың негізгі мазмұны – білім беру гранттарын тағайындау конкурсына, Ұлттық бірыңғай тестілеуге (ҰБТ) және арнаулы немесе шығармашылық емтихандарға қатысу ережелері. 
            Коллекцияның маңызды бөлігін TOEFL, IELTS, SAT, ACT, IB, A-Level және KAZTEST сияқты халықаралық стандартталған тесттердің сертификат ұпайларын ҰБТ балына ауыстыру шкалалары, сондай-ақ педагогика, денсаулық сақтау, өнер, спорт, журналистика және сәулет сияқты мамандықтар бойынша емтихан форматтарының тізімі құрайды. 
            Сонымен қатар, құжаттарда қабылдау комиссияларының жұмысы, апелляцияға өтініш беру, қабылдау квоталары, шетел азаматтарына қойылатын талаптар және басқа да ұйымдастырушылық мәселелер қамтылған.
            ГРАНТТАР БОЙЫНША НАҚТЫ САНДЫҚ ДЕРЕКТЕРДІ ҚАМТЫМАЙДЫ.
        """,
        #14
        "rct": """
            Эта коллекция содержит данные о региональных центрах тестирования (РЦТ) в Казахстане. 
            Каждый элемент данных включает наименование области на казахском и русском языках, уникальный идентификатор (id), код РЦТ, а также наименование и адрес центра как на казахском, так и на русском языках.
            Бұл коллекцияда Қазақстандағы аймақтық тестілеу орталықтары (АТӨ) туралы деректер бар. 
            Әрбір деректер элементі облыстың қазақ және орыс тілдеріндегі атауын, бірегей идентификаторды (id), АТӨ кодын, сондай-ақ орталықтың қазақ және орыс тілдеріндегі атауы мен мекенжайын қамтиды.
        """,
            #25
        #     "sub_combo_aug": """
        #         Бұл коллекцияда 2024 жылғы тамыздағы ЕНТ-ның бейіндік пәндер комбинациялары бойынша толық статистикалық деректер ұсынылған. 
        #         Әрбір деректер нүктесінде бейіндік пәндер комбинациясының атауы (мысалы, "Шығармашылық емтихан", "Математика - Физика" және т.б.), тестіленушілердің жалпы саны, сондай-ақ қазақ, орыс және ағылшын тілдеріндегі қатысушылар саны көрсетілген. Сонымен қатар, шекті деңгейден өткендер мен өтпегендердің саны туралы мәліметтер де қамтылған. Бұл коллекция ЕНТ-ға қатысушылардың пәндік таңдаулары мен нәтижелерін талдауға арналған.
        #         Эта коллекция содержит подробные статистические данные по комбинациям профильных предметов ЕНТ за август 2024 года.
        #         Каждая точка данных включает наименование комбинации профильных предметов (например, "Творческий экзамен", "Математика - Физика" и т.д.), общее количество тестируемых, а также число участников по языкам сдачи (казахский, русский, английский). Также представлены сведения о количестве преодолевших и не преодолевших пороговый уровень. Эта коллекция предназначена для анализа предметных предпочтений и результатов участников ЕНТ.
        #     """,
        #     #26
        #     "sub_combo_jan": """
        #         Бұл коллекцияда 2024 жылғы қаңтардағы ЕНТ-ның бейіндік пәндер комбинациялары бойынша толық статистикалық деректер ұсынылған. 
        #         Әрбір деректер нүктесінде бейіндік пәндер комбинациясының атауы (мысалы, "Шығармашылық емтихан", "Математика - Физика" және т.б.), тестіленушілердің жалпы саны, сондай-ақ қазақ, орыс және ағылшын тілдеріндегі қатысушылар саны көрсетілген. Сонымен қатар, шекті деңгейден өткендер мен өтпегендердің саны туралы мәліметтер де қамтылған. Бұл коллекция ЕНТ-ға қатысушылардың пәндік таңдаулары мен нәтижелерін талдауға арналған.
        #         Эта коллекция содержит подробные статистические данные по комбинациям профильных предметов ЕНТ за январь 2024 года.
        #         Каждая точка данных включает наименование комбинации профильных предметов (например, "Творческий экзамен", "Математика - Физика" и т.д.), общее количество тестируемых, а также число участников по языкам сдачи (казахский, русский, английский). Также представлены сведения о количестве преодолевших и не преодолевших пороговый уровень. Эта коллекция предназначена для анализа предметных предпочтений и результатов участников ЕНТ.
        #     """,
        #     #27
        #     "sub_combo_mar": """
        #         Бұл коллекцияда 2024 жылғы наурыздағы ЕНТ-ның бейіндік пәндер комбинациялары бойынша толық статистикалық деректер ұсынылған.
        #         Әрбір деректер нүктесінде бейіндік пәндер комбинациясының атауы (мысалы, "Шығармашылық емтихан", "Математика - Физика" және т.б.), тестіленушілердің жалпы саны, сондай-ақ қазақ, орыс және ағылшын тілдеріндегі қатысушылар саны көрсетілген. Сонымен қатар, шекті деңгейден өткендер мен өтпегендердің саны туралы мәліметтер де қамтылған. Бұл коллекция ЕНТ-ға қатысушылардың пәндік таңдаулары мен нәтижелерін талдауға арналған.
        #         Эта коллекция содержит подробные статистические данные по комбинациям профильных предметов ЕНТ за март 2024 года.
        #         Каждая точка данных включает наименование комбинации профильных предметов (например, "Творческий экзамен", "Математика - Физика" и т.д.), общее количество тестируемых, а также число участников по языкам сдачи (казахский, русский, английский). Также представлены сведения о количестве преодолевших и не преодолевших пороговый уровень. Эта коллекция предназначена для анализа предметных предпочтений и результатов участников ЕНТ.
        #     """,
        #     #28
        #     "sub_combo_may-jul": """
        #         Бұл коллекцияда 2024 жылғы мамыр мен шілде аралығындағы ЕНТ-ның бейіндік пәндер комбинациялары бойынша толық статистикалық деректер ұсынылған.
        #         Әрбір деректер нүктесінде бейіндік пәндер комбинациясының атауы (мысалы, "Шығармашылық емтихан", "Математика - Физика" және т.б.), тестіленушілердің жалпы саны, сондай-ақ қазақ, орыс және ағылшын тілдеріндегі қатысушылар саны көрсетілген. Сонымен қатар, шекті деңгейден өткендер мен өтпегендердің саны туралы мәліметтер де қамтылған. Бұл коллекция ЕНТ-ға қатысушылардың пәндік таңдаулары мен нәтижелерін талдауға арналған.
        #         Эта коллекция содержит подробные статистические данные по комбинациям профильных предметов ЕНТ за период с мая по июль 2024 года.
        #         Каждая точка данных включает наименование комбинации профильных предметов (например, "Творческий экзамен", "Математика - Физика" и т.д.), общее количество тестируемых, а также число участников по языкам сдачи (казахский, русский, английский). Также представлены сведения о количестве преодолевших и не преодолевших пороговый уровень. Эта коллекция предназначена для анализа предметных предпочтений и результатов участников ЕНТ.
        #     """,
        # }
        }